st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/MB1303_Provider_RTOS/Src/usbpd_dpm.c
#ifdef USBPD_CLI
#ifndef HAL_UART_MODULE_ENABLED
#error "To enable the CLI you need the HAL_UART_MODULE_ENABLED"
#endif
  /* CLI enabling */
  CLI_Init(BSP_USART_GetHandle());
  CLI_Run();
#endif /* USBPD_CLI */  
    
  /* PWR SET UP */
  USBPD_PWR_IF_Init();
  USBPD_PWR_IF_PowerResetGlobal();
  
  /* PE SET UP : Port 0 */
  USBPD_PE_Init(USBPD_PORT_0, DPM_Ports[USBPD_PORT_0].DPM_PortPowerRole, dpmCallbacks);
#if USBPD_PORT_COUNT == 2
   /* PE SET UP : Port 1 */
  USBPD_PE_Init(USBPD_PORT_1, DPM_Ports[USBPD_PORT_1].DPM_PortPowerRole, dpmCallbacks);
#endif /* USBPD_PORT_COUNT == 2 */

  /* CAD SET UP */
  USBPD_CAD_Init(USBPD_PORT_0, CAD_cbs);
#if USBPD_PORT_COUNT == 2
    /* CAD SET UP */
  USBPD_CAD_Init(USBPD_PORT_1, CAD_cbs);
#endif /* USBPD_PORT_COUNT == 2 */
    
  /* Enable CAD on Port 0 */
  USBPD_CAD_PortEnable(USBPD_PORT_0, USBPD_CAD_ENABLE);
#if USBPD_PORT_COUNT == 2
  /* Enable CAD on Port 1 */
  USBPD_CAD_PortEnable(USBPD_PORT_1, USBPD_CAD_ENABLE);
#endif /* USBPD_PORT_COUNT == 2 */
  
  /* create the CAD task */
  osThreadDef(CADTask, USBPD_CAD_Task, osPriorityLow, 0, configMINIMAL_STACK_SIZE * 2);
  CADTaskHandle = osThreadCreate(osThread(CADTask), NULL);
  
  /* PE task to be created on attachment */
  DPM_Ports[USBPD_PORT_0].PE_TaskHandle = NULL;
#if USBPD_PORT_COUNT==2
  DPM_Ports[USBPD_PORT_1].PE_TaskHandle = NULL;
#endif /* USBPD_PORT_COUNT == 2 */
  
  return USBPD_OK;
}

/**
  * @brief  Main tasks for PE layer
  * @param  argument: pointer to the PortNum
  * @retval None
  */
void USBPD_PE_Task(void const *argument)
{
  /* Get the port number passed as parameter */
  uint8_t PortNum = USBPD_PORT_0;
#if USBPD_PORT_COUNT>=2
  if (argument)
  {
    PortNum = *(uint8_t *)argument;
  }
#endif

  for(;;)
  {
    /* PE Source process */
    USBPD_PE_SRCProcess(PortNum);
    osDelay(1);
  }
}

/**
  * @brief  Main task for CAD layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_CAD_Task(void const *argument)
{
  for(;;)
  {
    USBPD_CAD_Process();
    osDelay(CAD_Task_delay);
  }
}

/**
  * @brief  CallBack reporting events on a specified port from CAD layer.
  * @param  PortNum The handle of the port
  * @param  State CAD state
  * @param  Cc	The Communication Channel for the USBPD communication
  * @retval None
  */
void USBPD_CAD_Callback(uint8_t PortNum, USBPD_CAD_STATE State, CCxPin_TypeDef Cc)
{
  /* check the port */
  assert_param(USBPD_PORT_IsValid(PortNum));

  /* get the current role from PE */    
  USBPD_PortPowerRole_TypeDef current_role = PE_GetPowerRole(PortNum);
  
  switch(State)
  {
  case USBPD_CAD_STATE_ATTACHED:
  case USBPD_CAD_STATE_ATTEMC:
    
#ifdef USBPD_LED_SERVER
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_BLINK_CC(Cc), 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_BLINK_VBUS, 0);
    Led_Set(DPM_Leds[PortNum].Role, (current_role == USBPD_PORTPOWERROLE_SRC ? LED_MODE_BLINK_ROLE_SRC : LED_MODE_BLINK_ROLE_SNK), 0);
#endif /* USBPD_LED_SERVER */

    /* In case Port role is provider only, Turn on power is executed in DPM callback */
    if (current_role == USBPD_PORTPOWERROLE_SRC)
    { 
    }
    
    DPM_Ports[PortNum].DPM_IsConnected = 1;
    USBPD_PE_IsCableConnected(PortNum, 1);
    
    PE_Reset(PortNum);
    
    /* Create PE task */
    if(DPM_Ports[PortNum].PE_TaskHandle == NULL)
    {
      osThreadDef(PETaskPORT, USBPD_PE_Task, osPriorityHigh, 0, configMINIMAL_STACK_SIZE * 3);
      DPM_Ports[PortNum].PE_TaskHandle = osThreadCreate(osThread(PETaskPORT), (void *)&PortNum);
    }

#ifdef USBPD_CLI
    /* prepare the attached output */
    sprintf(cli_text,  "\r\n*** [%d] attached on CC%d ", PortNum, Cc);
    strcat(cli_text, current_role == USBPD_PORTPOWERROLE_SRC ? "(Source)" : "(Sink)");
    if (DPM_Ports[PortNum].PE_TaskHandle == NULL)
    {
       strcat(cli_text, "(PE is not started!)"); 
    }
    strcat(cli_text, "\r\n");
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */
    break;
    
  case USBPD_CAD_STATE_EMC:
    break;
    
  case USBPD_CAD_STATE_DETACHED:
    if (current_role == USBPD_PORTPOWERROLE_SRC)
    { 
      /* Disable VBUS */
      USBPD_DPM_TurnOffPower(PortNum, PE_GetPowerRole(PortNum));

      /* Disable VCONN*/
      USBPD_PWR_IF_Enable_VConn(PortNum, CCNONE);

      /* a delay to be sure of the turn power off */
      osDelay(10);
    }

    /* The port pair is detached */
    USBPD_PE_IsCableConnected(PortNum, 0);
    
    /* Terminate PE task */
    if (DPM_Ports[PortNum].PE_TaskHandle != NULL)
    {
      osThreadTerminate(DPM_Ports[PortNum].PE_TaskHandle);
      DPM_Ports[PortNum].PE_TaskHandle = NULL;
    }
    
    /* perform a reset of all layer in any case */
    USBPD_PE_Reset(PortNum);
    
    /* Assert STUSB1602 software RESET */
    //HW_IF_RESET_CTRL(PortNum);
    
    /* Set the disconnection status */
    DPM_Ports[PortNum].DPM_IsConnected = 0;

#ifdef USBPD_CLI
    if (State == USBPD_CAD_STATE_DETACHED)
    {
      sprintf(cli_text, "\r\n*** [%d] detached\r\n", PortNum);
      CLI_Async_Notify(cli_text);
    }
#endif /* USBPD_CLI */
    
#ifdef USBPD_LED_SERVER      
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_OFF, 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);

    /* Check port role to initialize Role LED*/
    Led_Set(DPM_Leds[PortNum].Role, LED_MODE_FromPowerRole(DPM_Ports[PortNum].DPM_PortPowerRole), 0);
#endif /* USBPD_LED_SERVER */
    break;
    
  case USBPD_CAD_STATE_ACCESSORY:
#ifdef USBPD_CLI
    sprintf(cli_text, "\r\n*** [%d] attached: audio accessory not supported\r\n", PortNum);
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */    
    break;
    
  case USBPD_CAD_STATE_DEBUG:
#ifdef USBPD_CLI
    sprintf(cli_text, "\r\n*** [%d] attached: debug not supported\r\n", PortNum);
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */    
    break;
  default:
#ifdef USBPD_CLI
    sprintf(cli_text, "\r\n*** [%d] unknown status\r\n", PortNum);
    CLI_Async_Notify(cli_text);
#endif /* USBPD_CLI */    
    break;
  }
}

/**
  * @brief  Callback function called by PE layer when HardReset message received from PRL
  * @param  PortNum The current port number
  * @param  CurrentRole the current role
  * @param  Status status on hard reset event
  * @retval 0 if continue 1 otherwise
  */
static uint32_t USBPD_DPM_HardReset(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole, USBPD_HR_Status_TypeDef Status)
{
  HAL_StatusTypeDef res = HAL_ERROR;
  switch(Status)
  {
  case USBPD_HR_STATUS_START_ACK:
    res = USBPD_HW_IF_HR_Start(PortNum, CurrentRole, ACKNOWLEDGE);
    USBPD_DPM_TurnOffPower(PortNum, CurrentRole);
    break;
  case USBPD_HR_STATUS_START_REQ:
    res = USBPD_HW_IF_HR_Start(PortNum, CurrentRole, REQUEST);
    USBPD_DPM_TurnOffPower(PortNum, CurrentRole);
    break;
  case USBPD_HR_STATUS_WAIT_VBUS_VSAFE0V:
    res = USBPD_HW_IF_HR_CheckVbusVSafe0V(PortNum, CurrentRole);
#ifndef STUSB1602_CUT_1_3
    if (res == HAL_OK && CurrentRole == USBPD_PORTPOWERROLE_SNK)
    {
    /* Workaround: To emulate VBus0Safe condition starting from VBus_Presence condition */ 
      osDelay(300);
    }
#endif
    break;
  case USBPD_HR_STATUS_COMPLETED:
    res = USBPD_HW_IF_HR_End(PortNum, CurrentRole);
    USBPD_DPM_TurnOnPower(PortNum, CurrentRole);
    break;
  case USBPD_HR_STATUS_FAILED:
    res = USBPD_HW_IF_HR_End(PortNum, CurrentRole);
    break;
  default:
      break;
  }
  
  return res;
}

/**
  * @brief  Request the DPM to setup the new power level.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_SetupNewPower(uint8_t PortNum)
{
  uint8_t rdoposition;

  /* Retrieve Request DO position from DPM handle : RDO position in the table of PDO (possible value from 1 to 7) */
  rdoposition = DPM_Ports[PortNum].DPM_RDOPosition;

