st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/MB1303_Provider_RTOS/Src/usbpd_dpm.c
  /* Check type of information targeted by request */
  switch (DataId)
  {
    /* Case requested DO position Data information :
    */
    case USBPD_CORE_DATATYPE_RDO_POSITION :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RDOPosition = *Ptr;
      }
      break;

    /* Case requested Voltage Data information :
    */
    case USBPD_CORE_DATATYPE_REQ_VOLTAGE :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RequestedVoltage = *Ptr;
      }
      break;

    /* Case Received Source PDO values Data information :
    */
    case USBPD_CORE_DATATYPE_RCV_SRC_PDO : 
      if (Size <= USBPD_MAX_NB_PDO)
      {
        DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO = Size;
        /* Copy PDO data in DPM Handle field */
        for (index = 0; index < Size; index++)
        {
          DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index] = LE32(Ptr + index);
        }
      }
      break;

    /* Case Received Sink PDO values Data information :
    */
    case USBPD_CORE_DATATYPE_RCV_SNK_PDO :
      if (Size <= USBPD_MAX_NB_PDO)
      {
        DPM_Ports[PortNum].DPM_NumberOfRcvSNKPDO = Size;
        /* Copy PDO data in DPM Handle field */
        for (index = 0; index < Size; index++)
        {
          DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index] = LE32(Ptr + index);
        }
      }
      break;

    /* Case Received Request PDO Data information :
    */
    case USBPD_CORE_DATATYPE_RCV_REQ_PDO :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RcvRequestDOMsg = *Ptr;
      }
      break;

    /* Case RRequest message DO (from Sink to Source) Data information :
    */
    case USBPD_CORE_DATATYPE_REQUEST_DO :
      if (Size == 1)
      {
        DPM_Ports[PortNum].DPM_RcvRequestDOMsg = *Ptr;
      }
      break;

    /* In case of unexpected data type (Set request could not be fulfilled) :
    */
    default :
      break;
  }
}

/**
  * @brief  Evaluate received Request Message from Sink port  
  * @param  pdhandle Pointer to USB PD handle
  * @retval USBPD status
  */
static USBPD_StatusTypeDef USBPD_DPM_EvaluateRequest(uint8_t PortNum)
{
  uint32_t rdo = 0, pdo = 0, pdomaxcurrent = 0;
  uint32_t rdomaxcurrent = 0, rdoopcurrent = 0, rdoobjposition = 0;
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];

  rdo = pdhandle->DPM_RcvRequestDOMsg;
  rdomaxcurrent = rdo & 0x3FF;
  rdoopcurrent = (rdo >> 10) & 0x3FF;
  rdoobjposition = (rdo >> 28) & 0x7;
  pdhandle->DPM_RDOPosition = 0;
  
  /* Check if RDP can be met within the supported PDOs by the Source port */
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Evaluate Sink Request\r");
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Check if RDP can be met within the supported PDOs by the Source port\r");
  
  /* Search PDO in Port Source PDO list, that corresponds to Position provided in Request RDO */
  if (USBPD_PWR_IF_SearchRequestedPDO(PortNum, rdoobjposition, &pdo) != USBPD_OK)
  {
    /* Invalid PDO index */
    USBPD_ErrLog("USBPD_DPM_EvaluateRequest: Invalid PDOs index\r");
    return USBPD_FAIL;
  }

  pdomaxcurrent = (pdo & 0x3FF);
  
  if(rdoopcurrent > pdomaxcurrent)
  {
    /* Sink requests too much operating current */
    USBPD_ErrLog("USBPD_DPM_EvaluateRequest: Sink requests too much operating current\r");
    return USBPD_FAIL;
  }

  if(rdomaxcurrent > pdomaxcurrent)
  {
    /* Sink requests too much maximum operating current */
    USBPD_ErrLog("USBPD_DPM_EvaluateRequest: Sink requests too much maximum operating current\r");
    return USBPD_FAIL;
  }

  /* Set RDO position and requested voltage in DPM port structure */
  pdhandle->DPM_RequestedVoltage = ((pdo >> 10) & 0x3ff) * 50;
  pdhandle->DPM_RDOPosition = rdoobjposition;

  /* Accept the requested power */
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Sink requested %d mV %d mA for operating current from %d to %d mA\r",
               ((pdo >> 10) & 0x3ff) * 50, (pdo & 0x3ff) * 10,
               ((rdo >> 10) & 0x3ff) * 10, (rdo & 0x3ff) * 10);
  USBPD_UsrLog("USBPD_DPM_EvaluateRequest: Source accepts the requested power\r");

  return USBPD_OK;
}

/**
  * @brief  Update the status of the capability  
  * @param  PortNum Port number
  * @retval USBPD status
  */
static void USBPD_DPM_Capability(uint8_t PortNum, USBPD_PortPowerRole_TypeDef CurrentRole, USBPD_CAP_Status_TypeDef Status)
{
//    DPM_Ports[PortNum].DPM_RDOPosition = (DPM_Ports[PortNum].DPM_RequestDOMsg>>28);
  switch(Status)
  {
  case USBPD_CAP_STATUS_REQUESTING:
    /* Save the PDO Index and the RDO Requested */
    DPM_Ports[PortNum].DPM_RDOPositionPrevious  = DPM_Ports[PortNum].DPM_RDOPosition;
    DPM_Ports[PortNum].DPM_RequestDOMsgPrevious = DPM_Ports[PortNum].DPM_RequestDOMsg;
    break;
  case USBPD_CAP_STATUS_ACCEPTED:
    /* Update the */
    break;
  case USBPD_CAP_STATUS_REJECTED:
    DPM_Ports[PortNum].DPM_RDOPosition  = DPM_Ports[PortNum].DPM_RDOPositionPrevious;
    DPM_Ports[PortNum].DPM_RequestDOMsg = DPM_Ports[PortNum].DPM_RequestDOMsgPrevious;
    break;
  case USBPD_CAP_STATUS_WAIT:
    DPM_Ports[PortNum].DPM_RDOPosition  = DPM_Ports[PortNum].DPM_RDOPositionPrevious;
    DPM_Ports[PortNum].DPM_RequestDOMsg = DPM_Ports[PortNum].DPM_RequestDOMsgPrevious;
    break;
  default:
    break;
  }
  DPM_Ports[PortNum].DPM_RDOPosition = (DPM_Ports[PortNum].DPM_RequestDOMsg>>28);
}

/**
  * @brief  Evaluate received Capabilities Message from Source port and prepare the request message  
  * @param  PortNum Port number
  * @retval USBPD status
  */
static USBPD_StatusTypeDef USBPD_DPM_EvaluateCapabilities(uint8_t PortNum)
{
  uint32_t mv = 0, mw = 0, ma = 0, pdo;
  USBPD_SNKBatteryRDO_TypeDef rdpbattery;
  USBPD_SNKFixedVariableRDO_TypeDef rdpfixed;
  USBPD_HandleTypeDef *pdhandle = &DPM_Ports[PortNum];
  int32_t pdoindex = 0;
  
  pdhandle->DPM_RequestedVoltage = 0;
  
  USBPD_UsrLog("USBPD_DPM_EvaluateCapabilities: Port Partner Requests Max Voltage\r");
  
  /* Find the Pdo index for the requested voltage */    	
  pdoindex = DPM_FindVoltageIndex(PortNum, &(pdhandle->DPM_SNKRequestedPower));
  
  /* If could not find desired pdo index, then return error */
  if (pdoindex == -1)
  {
    USBPD_ErrLog("PE_EvaluateCapability: could not find desired voltage\r");
    
